import pytest
import pandas as pd


@pytest.fixture
def sample_transactions():
    """Фикстура для тестовых транзакций"""
    return pd.DataFrame(
        {
            "Дата операции": ["01.05.2023 10:00:00", "02.05.2023 12:00:00"],
            "Номер карты": ["1234", "5678"],
            "Сумма платежа": [-500.00, -300.00],
            "Категория": ["Супермаркеты", "Фастфуд"],
            "Описание": ["Лента", "KFC"],
        }
    )


@pytest.fixture
def sample_transactions_dict():
    """Фикстура для тестовых транзакций в формате словарей"""
    return [
        {"Дата операции": "2023-05-01", "Сумма операции": -1712.00},
        {"Дата операции": "2023-05-02", "Сумма операции": -345.50},
    ]
